@extends('layouts.landing')
@section('content')
<div class="row" style="padding: 0 40px">

    <div class="col-lg-12 p-0">
        {{-- @if (count($applicationNews->where('status',1)) != 0) --}}
        <div class="card card-success card-outline border-0">
            <div class="card-header">
                <h3 class="card-title m-0 px-4 py-3 d-flex gap-3 align-items-center">
                    <svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48" fill="none">
                        <mask id="mask0_1_3710" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="48" height="48">
                          <rect width="48" height="48" fill="#D9D9D9"/>
                        </mask>
                        <g mask="url(#mask0_1_3710)">
                          <path d="M1.00012 35.1562C1.00012 33.9538 1.3093 32.8631 1.92766 31.8841C2.54602 30.905 3.40485 30.175 4.50415 29.694C7.01193 28.5947 9.27065 27.8046 11.2803 27.3237C13.29 26.8427 15.3598 26.6023 17.4897 26.6023C19.6196 26.6023 21.6807 26.8427 23.6732 27.3237C25.6657 27.8046 27.9158 28.5947 30.4236 29.694C31.5229 30.175 32.3904 30.905 33.0259 31.8841C33.6614 32.8631 33.9792 33.9538 33.9792 35.1562V36.9082C33.9792 37.767 33.6786 38.497 33.0774 39.0982C32.4762 39.6994 31.7462 40 30.8874 40H4.09191C3.23308 40 2.50307 39.6994 1.90189 39.0982C1.30071 38.497 1.00012 37.767 1.00012 36.9082V35.1562ZM36.3496 40C36.5213 39.4847 36.6845 38.978 36.8391 38.4799C36.9937 37.9818 37.071 37.4579 37.071 36.9082V35.1562C37.071 32.9919 36.5729 31.2485 35.5766 29.9259C34.5804 28.6033 33.086 27.4954 31.0935 26.6023C33.4639 26.8771 35.6968 27.255 37.7924 27.7359C39.8879 28.2169 41.5884 28.8009 42.8938 29.4879C44.0275 30.1406 44.9207 30.9479 45.5734 31.9098C46.2261 32.8717 46.5525 33.9538 46.5525 35.1562V36.9082C46.5525 37.767 46.2519 38.497 45.6507 39.0982C45.0495 39.6994 44.3195 40 43.4607 40H36.3496ZM17.4897 23.4589C15.2223 23.4589 13.3673 22.7375 11.9244 21.2947C10.4816 19.8519 9.76019 17.9968 9.76019 15.7295C9.76019 13.4622 10.4816 11.6071 11.9244 10.1643C13.3673 8.72142 15.2223 8 17.4897 8C19.757 8 21.612 8.72142 23.0549 10.1643C24.4977 11.6071 25.2191 13.4622 25.2191 15.7295C25.2191 17.9968 24.4977 19.8519 23.0549 21.2947C21.612 22.7375 19.757 23.4589 17.4897 23.4589ZM36.0404 15.7295C36.0404 17.9968 35.319 19.8519 33.8761 21.2947C32.4333 22.7375 30.5782 23.4589 28.3109 23.4589C27.933 23.4589 27.5122 23.4332 27.0484 23.3816C26.5847 23.3301 26.1638 23.2356 25.786 23.0982C26.6104 22.2394 27.2374 21.183 27.6668 19.9291C28.0962 18.6753 28.3109 17.2754 28.3109 15.7295C28.3109 14.1836 28.0962 12.818 27.6668 11.6329C27.2374 10.4477 26.6104 9.35695 25.786 8.36071C26.1638 8.25765 26.5847 8.17177 27.0484 8.10306C27.5122 8.03435 27.933 8 28.3109 8C30.5782 8 32.4333 8.72142 33.8761 10.1643C35.319 11.6071 36.0404 13.4622 36.0404 15.7295Z" fill="#98C72E"/>
                        </g>
                      </svg>
                    ข่าวรับสมัครงาน</h3>
            </div>
            <div class="card-body p-0">
                <div class="p-5">
                    <p class="text-muted m-0">
                        ร่วมงานกับเราเพื่อเป็นส่วนหนึ่งของ องค์กรที่เป็นหนึ่งในผู้นำในอุตสาหกรรมแปรรูปเนื้อไก่ของประเทศไทย ผลิตภัณฑ์ของบริษัทได้รับการยอมรับจากลูกค้าทั้งในและต่างประเทศ บริษัทมุ่งมั่นพัฒนา คุณภาพผลิตภัณฑ์ และบริการอย่างต่อเนื่อง เพื่อตอบสนองความต้องการของลูกค้าและสร้างความพึงพอใจสูงสุด
                    </p>
                </div>
                <div class="px-5 d-flex flex-column gap-3">
                    @foreach ($applicationNews->where('status',1) as $applicationNew)
                        <div class="p-5 d-flex flex-column flex-lg-row justify-content-between" style="background: #F2F4F7; gap:56px">
                            <div class="d-flex flex-column justify-content-center align-items-center gap-2">
                                <h1 class="m-0" style="font-size: 40px">{{ $applicationNew->amount_apply }}</h1>
                                <h5><b>อัตรา</b></h5>
                            </div>
                            <div class="flex-grow-1">
                                <strong><h5>{{ $applicationNew->title }}</h5></strong>
                                <p class="text-muted m-0 job-intro">
                                    {!! $applicationNew->body !!}
                                </p>
                            </div>
                            <div>
                                <a href="{{route('post-job-application-news',['id' => $applicationNew->id])}}" class="btn btn-outline-secondary text-nowrap btn-lg">
                                    รายละเอียด
                                </a>
                            </div>

                        @endforeach
                    </div>
                </div>
                <div class="p-5 text-center">
                    <a href="#" class="text-primary px-3 py-2">งานทั้งหมด</a>
                </div>

            </div>
        </div>
        {{-- @endif --}}
    </div>

</div>
@endsection
